In [1]:
import numpy as np
import pandas as pd

#Data viz imports
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
column_names = ['user_id', 'item_id', 'rating', 'timestamp']
df = pd.read_csv('u.data', sep='\t', names=column_names )
df.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

In [3]:
movie_titles = pd.read_csv("Movie_Id_Titles")
movie_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [4]:
movie_df = df.merge(movie_titles, on = 'item_id')
movie_df.head()

   user_id  item_id  rating  timestamp                            title
0        0       50       5  881250949                 Star Wars (1977)
1        0      172       5  881250949  Empire Strikes Back, The (1980)
2        0      133       1  881250949        Gone with the Wind (1939)
3      196      242       3  881250949                     Kolya (1996)
4      186      302       3  891717742         L.A. Confidential (1997)

In [12]:
# Average rating per movie title
movie_df.groupby('title')['rating'].mean().sort_values()

title
Eye of Vichy, The (Oeil de Vichy, L') (1993)    1.0
Butterfly Kiss (1995)                           1.0
Daens (1992)                                    1.0
JLG/JLG - autoportrait de décembre (1994)       1.0
Touki Bouki (Journey of the Hyena) (1973)       1.0
                                               ...
Someone Else's America (1995)                   5.0
Star Kid (1997)                                 5.0
Santa with Muscles (1996)                       5.0
Prefontaine (1997)                              5.0
Marlene Dietrich: Shadow and Light (1996)       5.0
Name: rating, Length: 1664, dtype: float64

In [15]:
#Number of ratings per movie title
movie_df.groupby('title')['rating'].count().sort_values()

title
Á köldum klaka (Cold Fever) (1994)              1
Mille bolle blu (1993)                          1
Mat' i syn (1997)                               1
Marlene Dietrich: Shadow and Light (1996)       1
Man from Down Under, The (1943)                 1
                                             ...
Liar Liar (1997)                              485
Return of the Jedi (1983)                     507
Fargo (1996)                                  508
Contact (1997)                                509
Star Wars (1977)                              584
Name: rating, Length: 1664, dtype: int64

In [17]:
ratings = pd.DataFrame(movie_df.groupby('title')['rating'].mean())
ratings['num of ratings'] = pd.DataFrame(movie_df.groupby('title')['rating'].count())

#Ratings dataframe with the average rating and number of ratings per movie
ratings.head()

                             rating  num of ratings
title
'Til There Was You (1997)  2.333333               9
1-900 (1994)               2.600000               5
101 Dalmatians (1996)      2.908257             109
12 Angry Men (1957)        4.344000             125
187 (1997)                 3.024390              41